using System.Collections.Generic;
using static Shining_BeautifulGirls.World.NamePool;

namespace Shining_BeautifulGirls
{
    partial class World
    {
        private static Dictionary<string, double[]> ZoneLocation { get; } = new()
        {
{"事件类型",[0.1528,0.4514,0.1641,0.1836]},
{"事件名",[0.1528,0.7639,0.1914,0.2148]},
{"日历",[0.0000,0.2083,0.0508,0.1484]},
{"心情",[0.7361,0.9722,0.1078,0.1430]},
{"体力",[0.3097,0.8333,0.1133,0.1383]},
{"协助1",[0.8056,0.9722,0.1445,0.2266]},
{"协助2",[0.8056,0.9722,0.2266,0.3203]},
{"协助3",[0.8056,0.9722,0.3203,0.4141]},
{"协助4",[0.8056,0.9722,0.4141,0.5078]},
{"协助5",[0.8056,0.9722,0.5078,0.6016]},
{"速度增加",[0.0347,0.1944,0.6055,0.6445]},
{"耐力增加",[0.1944,0.3472,0.6055,0.6445]},
{"力量增加",[0.3472,0.5069,0.6055,0.6445]},
{"毅力增加",[0.5069,0.6597,0.6055,0.6445]},
{"智力增加",[0.6597,0.8125,0.6055,0.6445]},
{"速度",[0.0903,0.1944,0.6680,0.6898]},
{"耐力",[0.2500,0.3472,0.6680,0.6898]},
{"力量",[0.4028,0.5069,0.6680,0.6898]},
{"毅力",[0.5625,0.6597,0.6680,0.6898]},
{"智力",[0.7153,0.8125,0.6680,0.6898]},
{"第1队",[0.7222,0.9514,0.3438,0.3711]},
{"第2队",[0.7222,0.9514,0.5547,0.5820]},
{"第3队",[0.7222,0.9514,0.7656,0.7930]},
{"卡1",[0.0486,0.2222,0.0625,0.2422]},
{"卡2",[0.0486,0.2222,0.1953,0.3750]},
{"卡3",[0.0486,0.2222,0.3359,0.5117]},
{"卡4",[0.0486,0.2222,0.4688,0.6484]},
{"卡5",[0.0486,0.2222,0.6094,0.7812]},
{"技1",[0.0139,0.6944,0.3633,0.5156]},
{"技2",[0.0139,0.6944,0.4844,0.6562]},
{"技3",[0.0139,0.6944,0.6250,0.7812]},
{"技白",[0.0139,0.4167,0.7422,0.8008]},
{"技能点",[0.8333,0.9653,0.7188,0.7539]},
{"技能点2",[0.7222,0.9028,0.3125,0.3438]},
        };

        public static class NamePool
        {
            public enum Button
            {
                强化编成,
                剧情,
                主页,
                赛事,
                JJC1,
                JJC2,
                第1队,
                第2队,
                第3队,
                JJC3,
                JJC4,
                竞技场连点,
                日常赛事,
                日1,
                日2,
                日3,
                取消,
                扭蛋,
                养成,
                继续,
                大弹窗确认,
                优先活动卡,
                自动编成确认,
                使用宝石,
                使用能量饮料,
                加号,
                刷新协助卡,
                开始养成,
                快进,
                弹窗勾选,
                弹窗确认,
                跳过,
                缩短所有事件,
                缩短事件确定,
                休息,
                训练,
                技能,
                医务室,
                外出,
                返回,
                速度,
                耐力,
                力量,
                毅力,
                智力,
                参赛,
                查看结果,
                前往赛事,
                比赛快进,
                比赛结束1,
                比赛结束2,
                比赛结束3,
                选择倒二,
                选择末尾,
                选卡,
                卡1,
                卡2,
                卡3,
                卡4,
                卡5,
                技能获取,
                结束养成,
                养成结束,
                结束连点,
                不弹赛事推荐,
            }
        }

        private static void InitLocInfo()
        {
            MakeButton(Button.强化编成, 75, 1225);
            MakeButton(Button.剧情, 190, 1225);
            MakeButton(Button.主页, 360, 1225);
            MakeButton(Button.赛事, 520, 1225);
            MakeButton(Button.JJC1, 208, 864);
            MakeButton(Button.JJC2, 360, 810);
            MakeButton(Button.第1队, 360, 350);
            MakeButton(Button.第2队, 360, 620);
            MakeButton(Button.第3队, 360, 890);
            MakeButton(Button.JJC3, 510, 913);
            MakeButton(Button.JJC4, 457, 1063);
            MakeButton(Button.竞技场连点, 320, 1180);
            MakeButton(Button.日常赛事, 210, 1040);
            MakeButton(Button.日1, 360, 690);
            MakeButton(Button.日2, 360, 840);
            MakeButton(Button.日3, 360, 980);
            MakeButton(Button.取消, 200, 1180);
            MakeButton(Button.扭蛋, 640, 1225);
            MakeButton(Button.养成, 540, 1080);
            MakeButton(Button.继续, 360, 1080);
            MakeButton(Button.大弹窗确认, 515, 915);
            MakeButton(Button.优先活动卡, 233, 657);
            MakeButton(Button.自动编成确认, 515, 830);
            MakeButton(Button.使用宝石, 610, 180);
            MakeButton(Button.使用能量饮料, 610, 320);
            MakeButton(Button.加号, 523, 670);
            MakeButton(Button.刷新协助卡, 650, 1005);
            MakeButton(Button.开始养成, 515, 1174);
            MakeButton(Button.快进, 651, 1209);
            MakeButton(Button.弹窗勾选, 245, 705);
            MakeButton(Button.弹窗确认, 515, 833);
            MakeButton(Button.跳过, 258, 1244);
            MakeButton(Button.缩短所有事件, 68, 623);
            MakeButton(Button.缩短事件确定, 360, 915);
            MakeButton(Button.休息, 115, 985);
            MakeButton(Button.训练, 355, 985);
            MakeButton(Button.技能, 210, 1075);
            MakeButton(Button.医务室, 160, 1125);
            MakeButton(Button.外出, 400, 1125);
            MakeButton(Button.返回, 85, 1200);
            MakeButton(Button.速度, 100, 1080);
            MakeButton(Button.耐力, 230, 1080);
            MakeButton(Button.力量, 360, 1080);
            MakeButton(Button.毅力, 490, 1080);
            MakeButton(Button.智力, 620, 1080);
            MakeButton(Button.参赛, 505, 1080);
            MakeButton(Button.查看结果, 252, 1172);
            MakeButton(Button.前往赛事, 465, 1170);
            MakeButton(Button.比赛快进, 560, 1225);
            MakeButton(Button.比赛结束1, 360, 1180);
            MakeButton(Button.比赛结束2, 430, 1180);
            MakeButton(Button.比赛结束3, 360, 1110);
            MakeButton(Button.选择倒二, 360, 715);
            MakeButton(Button.选择末尾, 360, 830);
            MakeButton(Button.选卡, 570, 680);
            MakeButton(Button.卡1, 360, 200);
            MakeButton(Button.卡2, 360, 375);
            MakeButton(Button.卡3, 360, 545);
            MakeButton(Button.卡4, 360, 720);
            MakeButton(Button.卡5, 360, 900);
            MakeButton(Button.技能获取, 520, 1180);
            MakeButton(Button.结束养成, 205, 915);
            MakeButton(Button.养成结束, 510, 1050);
            MakeButton(Button.结束连点, 360, 1145);
            MakeButton(Button.不弹赛事推荐, 260, 1035);
        }

        private static void MakeButton(Button bt, double x, double y)
        {
            var rX = x / STANDARD_WIDTH;
            var rY = y / STANDARD_HEIGHT;
            ButtonLocation.Add(bt.ToString(), [rX, rY]);
        }


        private static Dictionary<string, double[]> ButtonLocation { get; } = new()
            {
{"强化编成",[0.1042,0.9570]},
{"剧情",[0.2639,0.9570]},
{"主页",[0.5000,0.9570]},
{"赛事",[0.7222,0.9570]},
{"JJC1",[0.2889,0.6750]},
{"JJC2",[0.5000,0.6328]},
{"第1队",[0.5000,0.2734]},
{"第2队",[0.5000,0.4844]},
{"第3队",[0.5000,0.6953]},
{"JJC3",[0.7083,0.7133]},
{"JJC4",[0.6347,0.8305]},
{"竞技场连点",[0.4444,0.9219]},
{"日常赛事",[0.2917,0.8125]},
{"日1",[0.5000,0.5391]},
{"日2",[0.5000,0.6562]},
{"日3",[0.5000,0.7656]},
{"取消",[0.2778,0.9219]},
{"扭蛋",[0.8889,0.9570]},
{"养成",[0.7500,0.8438]},
{"继续",[0.5000,0.8438]},
{"大弹窗确认",[0.7153,0.7148]},
{"优先活动卡",[0.3236,0.5133]},
{"自动编成确认",[0.7153,0.6484]},
{"使用宝石",[0.8472,0.1406]},
{"使用能量饮料",[0.8472,0.2500]},
{"加号",[0.7264,0.5234]},
{"刷新协助卡",[0.9028,0.7852]},
{"开始养成",[0.7153,0.9172]},
{"快进",[0.9042,0.9445]},
{"弹窗勾选",[0.3403,0.5508]},
{"弹窗确认",[0.7153,0.6508]},
{"跳过",[0.3583,0.9719]},
{"缩短所有事件",[0.0944,0.4867]},
{"缩短事件确定",[0.5000,0.7148]},
{"休息",[0.1597,0.7695]},
{"训练",[0.4931,0.7695]},
{"技能",[0.2917,0.8398]},
{"医务室",[0.2222,0.8789]},
{"外出",[0.5556,0.8789]},
{"返回",[0.1181,0.9375]},
{"速度",[0.1389,0.8438]},
{"耐力",[0.3194,0.8438]},
{"力量",[0.5000,0.8438]},
{"毅力",[0.6806,0.8438]},
{"智力",[0.8611,0.8438]},
{"参赛",[0.7014,0.8438]},
{"查看结果",[0.3500,0.9156]},
{"前往赛事",[0.6458,0.9141]},
{"比赛快进",[0.7778,0.9570]},
{"比赛结束1",[0.5000,0.9219]},
{"比赛结束2",[0.5972,0.9219]},
{"比赛结束3",[0.5000,0.8672]},
{"选择倒二",[0.5000,0.5586]},
{"选择末尾",[0.5000,0.6484]},
{"选卡",[0.7917,0.5312]},
{"卡1",[0.5000,0.1562]},
{"卡2",[0.5000,0.2930]},
{"卡3",[0.5000,0.4258]},
{"卡4",[0.5000,0.5625]},
{"卡5",[0.5000,0.7031]},
{"技能获取",[0.7222,0.9219]},
{"结束养成",[0.2847,0.7148]},
{"养成结束",[0.7083,0.8203]},
{"结束连点",[0.5000,0.8945]},
{"不弹赛事推荐",[0.3611,0.8086]},
            };
    }
}
